import random

vocab = {
    "陰キャ": "いんきゃ",
    "輝く": "かがやく",
    "唯一の": "ゆいいつの",
    "場所": "ばしょ",
    "僕": "ぼく",
    "学生": "がくせい",
    "時代": "じだい",
    "教室": "きょうしつ",
    "隅": "すみ",
    "暗い": "くらい",
    "人間": "にんげん",
    "若者": "わかもの",
    "中心": "ちゅうしん",
    "大人気": "だいにんき",
    "中学": "ちゅうがく",
    "お父さん": "おとうさん",
    "貸す": "かす",
    "娘": "むすめ",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
}

keys = list(vocab.keys())

while (True):
    random.shuffle(keys)
    for d in keys:
        d_ans = vocab[d]

        while (True):
            print(d)
            ans = input("> ")
            if ans != d_ans:
                print("WRONG    -   " + d_ans)
            else:
                break
