import random

vocab = {
    "陰キャ": "いんきゃ",
    "輝く": "かがやく",
    "唯一の": "ゆいいつの",
    "場所": "ばしょ",
    "僕": "ぼく",
    "学生": "がくせい",
    "時代": "じだい",
    "教室": "きょうしつ",
    "隅": "すみ",
    "暗い": "くらい",
    "人間": "にんげん",
    "若者": "わかもの",
    "中心": "ちゅうしん",
    "大人気": "だいにんき",
    "中学": "ちゅうがく",
    "お父さん": "おとうさん",
    "貸す": "かす",
    "娘": "むすめ",
    "Kanji: 山": "さんやま",
    "Kanji: 川": "せんかわ",
    "Kanji: 田": "でんた",
    "Kanji: 気": "き",
    "Kanji: 雨": "うあめ",
    "Kanji: 天": "てん",
    "Kanji: 一": "いちひと",
    "Kanji: 二": "にふた",
    "Kanji: 三": "さんみっつ",
    "Kanji: 四": "しよっつ",
    "Kanji: 五": "ごいっつ",
    "Kanji: 六": "ろくむっつ",
    "Kanji: 七": "しちななつ",
    "Kanji: 八": "はちやっつ",
    "Kanji: 九": "きゅうここの",
    "Kanji: 十": "じゅうとお",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
    # "": "",
}

keys = list(vocab.keys())

while (True):
    random.shuffle(keys)
    for d in keys:
        d_ans = vocab[d]

        while (True):
            print(d)
            ans = input("> ")
            if ans != d_ans:
                print("WRONG    -   " + d_ans)
            else:
                break
